Revit 2026 API

# DXFExportOptions(DXFExportOptions) Constructor

---

Constructs a new instance of DXFImportOptions as a copy of the export options.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public DXFExportOptions(
	DXFExportOptions option
)
```
```vb
Public Sub New (
	option As DXFExportOptions
)
```
```cpp
public:
DXFExportOptions(
	DXFExportOptions^ option
)
```
```fsharp
new :
        option : DXFExportOptions -> DXFExportOptions
```

#### Parameters

option DXFExportOptions
     The options to be copied.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

DXFExportOptions Class

DXFExportOptions Overload

Autodesk.Revit.DB Namespace